{
  "nodes": [
    {
      "op": "null", 
      "name": "seq_data", 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attr": {"shape": "(10, 1, 2, 5)"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attr": {
        "kernel": "(2, 5)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attr": {
        "kernel": "(2, 5)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attr": {
        "kernel": "(2, 5)", 
        "num_filter": "10"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attr": {
        "kernel": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attr": {
        "kernel": "(2, 5)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attr": {
        "kernel": "(2, 5)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attr": {
        "kernel": "(2, 5)", 
        "num_filter": "10"
      }, 
      "inputs": [[1, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling1", 
      "attr": {
        "kernel": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attr": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[6, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attr": {"target_shape": "(10, 20)"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attr": {
        "axis": "1", 
        "num_outputs": "20", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gru_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t0__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t0__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "gru_begin_state_0", 
      "attr": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 92)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t0__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[20, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t0__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[19, 1, 0], [24, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t0__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar0", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[19, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t0__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul0", 
      "inputs": [[29, 0, 0], [24, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[19, 2, 0], [30, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t0__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul1", 
      "inputs": [[27, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul2", 
      "inputs": [[26, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t0_out", 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t1__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 1, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t1__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t1__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[35, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t1__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[41, 1, 0], [43, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t1__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar1", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[41, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t1__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul3", 
      "inputs": [[48, 0, 0], [43, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[41, 2, 0], [49, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t1__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul4", 
      "inputs": [[46, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5", 
      "inputs": [[45, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t1_out", 
      "inputs": [[52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout2", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected1", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[55, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t2__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 2, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t2__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t2__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[54, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t2__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[60, 1, 0], [62, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t2__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar2", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[60, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t2__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul6", 
      "inputs": [[67, 0, 0], [62, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[60, 2, 0], [68, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t2__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul7", 
      "inputs": [[65, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul8", 
      "inputs": [[64, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t2_out", 
      "inputs": [[71, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout3", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected2", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t3__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 3, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t3__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t3__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[73, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t3__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[79, 1, 0], [81, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t3__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar3", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[79, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t3__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul9", 
      "inputs": [[86, 0, 0], [81, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[79, 2, 0], [87, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t3__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10", 
      "inputs": [[84, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul11", 
      "inputs": [[83, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t3_out", 
      "inputs": [[90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout4", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected3_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected3_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected3", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[93, 0, 0], [94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t4__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 4, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t4__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t4__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[92, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t4__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[98, 1, 0], [100, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t4__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar4", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[98, 0, 0], [100, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t4__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul12", 
      "inputs": [[105, 0, 0], [100, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[98, 2, 0], [106, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t4__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul13", 
      "inputs": [[103, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul14", 
      "inputs": [[102, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t4_out", 
      "inputs": [[109, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout5", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected4_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected4_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected4", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t5__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 5, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t5__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t5__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[111, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t5__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus16", 
      "inputs": [[117, 1, 0], [119, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t5__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar5", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[117, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t5__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul15", 
      "inputs": [[124, 0, 0], [119, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[117, 2, 0], [125, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t5__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul16", 
      "inputs": [[122, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul17", 
      "inputs": [[121, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t5_out", 
      "inputs": [[128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout6", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected5_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected5_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected5", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t6__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 6, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t6__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t6__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[130, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t6__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus19", 
      "inputs": [[136, 1, 0], [138, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t6__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar6", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus18", 
      "inputs": [[136, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t6__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul18", 
      "inputs": [[143, 0, 0], [138, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus20", 
      "inputs": [[136, 2, 0], [144, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t6__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul19", 
      "inputs": [[141, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul20", 
      "inputs": [[140, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t6_out", 
      "inputs": [[147, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout7", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected6_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected6_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected6", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t7__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 7, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t7__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t7__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[149, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t7__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus22", 
      "inputs": [[155, 1, 0], [157, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t7__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar7", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus21", 
      "inputs": [[155, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t7__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul21", 
      "inputs": [[162, 0, 0], [157, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus23", 
      "inputs": [[155, 2, 0], [163, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t7__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul22", 
      "inputs": [[160, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul23", 
      "inputs": [[159, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t7_out", 
      "inputs": [[166, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout8", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected7_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected7_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected7", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t8__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 8, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t8__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t8__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[168, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t8__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus25", 
      "inputs": [[174, 1, 0], [176, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t8__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar8", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus24", 
      "inputs": [[174, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t8__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul24", 
      "inputs": [[181, 0, 0], [176, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus26", 
      "inputs": [[174, 2, 0], [182, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t8__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul25", 
      "inputs": [[179, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul26", 
      "inputs": [[178, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t8_out", 
      "inputs": [[185, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout9", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected8_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected8_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected8", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[188, 0, 0], [189, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t9__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 9, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t9__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t9__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[187, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t9__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus28", 
      "inputs": [[193, 1, 0], [195, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t9__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar9", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus27", 
      "inputs": [[193, 0, 0], [195, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t9__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul27", 
      "inputs": [[200, 0, 0], [195, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus29", 
      "inputs": [[193, 2, 0], [201, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t9__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul28", 
      "inputs": [[198, 0, 0], [203, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul29", 
      "inputs": [[197, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t9_out", 
      "inputs": [[204, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout10", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected9_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected9_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected9", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[207, 0, 0], [208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t10__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 10, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t10__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t10__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[206, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t10__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus31", 
      "inputs": [[212, 1, 0], [214, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t10__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar10", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[216, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus30", 
      "inputs": [[212, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t10__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul30", 
      "inputs": [[219, 0, 0], [214, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus32", 
      "inputs": [[212, 2, 0], [220, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t10__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul31", 
      "inputs": [[217, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul32", 
      "inputs": [[216, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t10_out", 
      "inputs": [[223, 0, 0], [224, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout11", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected10_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected10_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected10", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[226, 0, 0], [227, 0, 0], [228, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t11__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 11, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t11__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[230, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t11__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[225, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t11__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus34", 
      "inputs": [[231, 1, 0], [233, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t11__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar11", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus33", 
      "inputs": [[231, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t11__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul33", 
      "inputs": [[238, 0, 0], [233, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus35", 
      "inputs": [[231, 2, 0], [239, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t11__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul34", 
      "inputs": [[236, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul35", 
      "inputs": [[235, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t11_out", 
      "inputs": [[242, 0, 0], [243, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout12", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected11_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected11_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected11", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[245, 0, 0], [246, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t12__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 12, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t12__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[249, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t12__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[244, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t12__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus37", 
      "inputs": [[250, 1, 0], [252, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t12__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[253, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar12", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[254, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus36", 
      "inputs": [[250, 0, 0], [252, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t12__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[256, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul36", 
      "inputs": [[257, 0, 0], [252, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus38", 
      "inputs": [[250, 2, 0], [258, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t12__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[259, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul37", 
      "inputs": [[255, 0, 0], [260, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul38", 
      "inputs": [[254, 0, 0], [244, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t12_out", 
      "inputs": [[261, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout13", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[263, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected12_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected12_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected12", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[264, 0, 0], [265, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t13__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 13, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t13__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[268, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t13__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[263, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t13__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus40", 
      "inputs": [[269, 1, 0], [271, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t13__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[272, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar13", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[273, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus39", 
      "inputs": [[269, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t13__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[275, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul39", 
      "inputs": [[276, 0, 0], [271, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus41", 
      "inputs": [[269, 2, 0], [277, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t13__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul40", 
      "inputs": [[274, 0, 0], [279, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul41", 
      "inputs": [[273, 0, 0], [263, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t13_out", 
      "inputs": [[280, 0, 0], [281, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout14", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected13_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected13_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected13", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[283, 0, 0], [284, 0, 0], [285, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t14__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 14, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t14__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[287, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t14__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[282, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t14__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[289, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus43", 
      "inputs": [[288, 1, 0], [290, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t14__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar14", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus42", 
      "inputs": [[288, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t14__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[294, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul42", 
      "inputs": [[295, 0, 0], [290, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus44", 
      "inputs": [[288, 2, 0], [296, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t14__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[297, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul43", 
      "inputs": [[293, 0, 0], [298, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul44", 
      "inputs": [[292, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t14_out", 
      "inputs": [[299, 0, 0], [300, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout15", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[301, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected14_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected14_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected14", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[302, 0, 0], [303, 0, 0], [304, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t15__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 15, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t15__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t15__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[301, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t15__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[308, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus46", 
      "inputs": [[307, 1, 0], [309, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t15__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar15", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[311, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus45", 
      "inputs": [[307, 0, 0], [309, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t15__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[313, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul45", 
      "inputs": [[314, 0, 0], [309, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus47", 
      "inputs": [[307, 2, 0], [315, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t15__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[316, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul46", 
      "inputs": [[312, 0, 0], [317, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul47", 
      "inputs": [[311, 0, 0], [301, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t15_out", 
      "inputs": [[318, 0, 0], [319, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout16", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[320, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected15_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected15_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected15", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[321, 0, 0], [322, 0, 0], [323, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t16__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 16, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t16__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[325, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t16__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[320, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t16__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[327, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus49", 
      "inputs": [[326, 1, 0], [328, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t16__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[329, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar16", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus48", 
      "inputs": [[326, 0, 0], [328, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t16__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[332, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul48", 
      "inputs": [[333, 0, 0], [328, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus50", 
      "inputs": [[326, 2, 0], [334, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t16__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[335, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul49", 
      "inputs": [[331, 0, 0], [336, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul50", 
      "inputs": [[330, 0, 0], [320, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t16_out", 
      "inputs": [[337, 0, 0], [338, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout17", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[339, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected16_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected16_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected16", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[340, 0, 0], [341, 0, 0], [342, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t17__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 17, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t17__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[344, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t17__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[339, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t17__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[346, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus52", 
      "inputs": [[345, 1, 0], [347, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t17__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[348, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar17", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[349, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus51", 
      "inputs": [[345, 0, 0], [347, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t17__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[351, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul51", 
      "inputs": [[352, 0, 0], [347, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus53", 
      "inputs": [[345, 2, 0], [353, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t17__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[354, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul52", 
      "inputs": [[350, 0, 0], [355, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul53", 
      "inputs": [[349, 0, 0], [339, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t17_out", 
      "inputs": [[356, 0, 0], [357, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout18", 
      "attr": {
        "mode": "training", 
        "p": "0.01"
      }, 
      "inputs": [[358, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected17_weight", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected17_bias", 
      "attr": {"num_hidden": "5"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected17", 
      "attr": {"num_hidden": "5"}, 
      "inputs": [[359, 0, 0], [360, 0, 0], [361, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t18__i2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[15, 18, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t18__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[363, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t18__h2h", 
      "attr": {"num_hidden": "276"}, 
      "inputs": [[358, 0, 0], [21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t18__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[365, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus55", 
      "inputs": [[364, 1, 0], [366, 1, 0]]
    }, 
    {
      "op": "Activation", 
