{
  "nodes": [
    {
      "op": "null", 
      "name": "seq_data", 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attr": {"shape": "(30, 1, 168, 321)"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad0", 
      "attr": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 5, 0, 0, 0)"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attr": {
        "kernel": "(6, 321)", 
        "num_filter": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attr": {
        "kernel": "(6, 321)", 
        "num_filter": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attr": {
        "kernel": "(6, 321)", 
        "num_filter": "1"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attr": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attr": {"target_shape": "(30, 168, 1)"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attr": {
        "dim": "2", 
        "num_args": "1"
      }, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attr": {"p": "0.1"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attr": {
        "axis": "1", 
        "num_outputs": "168", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gru_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t167__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 167, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t167__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t166__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 166, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t166__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t165__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 165, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t165__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t164__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 164, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t164__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t163__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 163, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t163__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t162__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 162, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t162__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t161__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 161, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t161__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t160__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 160, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t160__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t159__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 159, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t159__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t158__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 158, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t158__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t157__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 157, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t157__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t156__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 156, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t156__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t155__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 155, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t155__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t154__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 154, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t154__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t153__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 153, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t153__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t152__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 152, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t152__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t151__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 151, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t151__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t150__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 150, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t150__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t149__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 149, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t149__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t148__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 148, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t148__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t147__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 147, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t147__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t146__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 146, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t146__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t145__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 145, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t145__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t144__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 144, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t144__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t143__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 143, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t143__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t142__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 142, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t142__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t141__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 141, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t141__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t140__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 140, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t140__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t139__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 139, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t139__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t138__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 138, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t138__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t137__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 137, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t137__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t136__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 136, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t136__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t135__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 135, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t135__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t134__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 134, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t134__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t133__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 133, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t133__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t132__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 132, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t132__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t131__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 131, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t131__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t130__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 130, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t130__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t129__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 129, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t129__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t128__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 128, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t128__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t127__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 127, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t127__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t126__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 126, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t126__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t125__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 125, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t125__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t124__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 124, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t124__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t123__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 123, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t123__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t122__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 122, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t122__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t121__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 121, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t121__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t120__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 120, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t120__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t119__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 119, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t119__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t118__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 118, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t118__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t117__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 117, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t117__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t116__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 116, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t116__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t115__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 115, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t115__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t114__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 114, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t114__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t113__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 113, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t113__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t112__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 112, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t112__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t111__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 111, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t111__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t110__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 110, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t110__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t109__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 109, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t109__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t108__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 108, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t108__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t107__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 107, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t107__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t106__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 106, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t106__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t105__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 105, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t105__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t104__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 104, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t104__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t103__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 103, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t103__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t102__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 102, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t102__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t101__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 101, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t101__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t100__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 100, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t100__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t99__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 99, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t99__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t98__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 98, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t98__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t97__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 97, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t97__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t96__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 96, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t96__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t95__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 95, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t95__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t94__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 94, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t94__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t93__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 93, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t93__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t92__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 92, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t92__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t91__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 91, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t91__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t90__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 90, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t90__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t89__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 89, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t89__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t88__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 88, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t88__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t87__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 87, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t87__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t86__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 86, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t86__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t85__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 85, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t85__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t84__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 84, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t84__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t83__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 83, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t83__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t82__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 82, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t82__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t81__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 81, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t81__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t80__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 80, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t80__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t79__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 79, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t79__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t78__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 78, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t78__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t77__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 77, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t77__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t76__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 76, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t76__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t75__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 75, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t75__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t74__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 74, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t74__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t73__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 73, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t73__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t72__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 72, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t72__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t71__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 71, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t71__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t70__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 70, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t70__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t69__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 69, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t69__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t68__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 68, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t68__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t67__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 67, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t67__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t66__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 66, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t66__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[216, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t65__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 65, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t65__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t64__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 64, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t64__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t63__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 63, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t63__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[222, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t62__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 62, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t62__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t61__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 61, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t61__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t60__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 60, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t60__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t59__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 59, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t59__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[230, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t58__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 58, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t58__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t57__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 57, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t57__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t56__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 56, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t56__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[236, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t55__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 55, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t55__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t54__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 54, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t54__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t53__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 53, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t53__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t52__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 52, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t52__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t51__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 51, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t51__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t50__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 50, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t50__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t49__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 49, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t49__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t48__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 48, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t48__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t47__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 47, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t47__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[254, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t46__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 46, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t46__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[256, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t45__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 45, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t45__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t44__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 44, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t44__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t43__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 43, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t43__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[262, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t42__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 42, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t42__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[264, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t41__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 41, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t41__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[266, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t40__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 40, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t40__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[268, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t39__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 39, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t39__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t38__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 38, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t38__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[272, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t37__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 37, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t37__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t36__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 36, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t36__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[276, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t35__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 35, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t35__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t34__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 34, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t34__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t33__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 33, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t33__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t32__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 32, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t32__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t31__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 31, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t31__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t30__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 30, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t30__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t29__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 29, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t29__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[290, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t28__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 28, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t28__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t27__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 27, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t27__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[294, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t26__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 26, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t26__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t25__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 25, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t25__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t24__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 24, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t24__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[300, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t23__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 23, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t23__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[302, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t22__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 22, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t22__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t21__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 21, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t21__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t20__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 20, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t20__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[308, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t19__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 19, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t19__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t18__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 18, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t18__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[312, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t17__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 17, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t17__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[314, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t16__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 16, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t16__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[316, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t15__i2h", 
      "attr": {"num_hidden": "3"}, 
      "inputs": [[11, 15, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
