{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attr": {"shape": "(0, 1, 100, -1)"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad0", 
      "attr": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 2, 0, 0, 0)"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attr": {
        "kernel": "(3, 321)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attr": {
        "kernel": "(3, 321)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attr": {
        "kernel": "(3, 321)", 
        "num_filter": "4"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attr": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attr": {"shape": "(0, 0, 0)"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad1", 
      "attr": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 3, 0, 0, 0)"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attr": {
        "kernel": "(4, 321)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attr": {
        "kernel": "(4, 321)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attr": {
        "kernel": "(4, 321)", 
        "num_filter": "4"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose1", 
      "attr": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attr": {"shape": "(0, 0, 0)"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad2", 
      "attr": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 4, 0, 0, 0)"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attr": {
        "kernel": "(5, 321)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attr": {
        "kernel": "(5, 321)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attr": {
        "kernel": "(5, 321)", 
        "num_filter": "4"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose2", 
      "attr": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape3", 
      "attr": {"shape": "(0, 0, 0)"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad3", 
      "attr": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 5, 0, 0, 0)"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attr": {
        "kernel": "(6, 321)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attr": {
        "kernel": "(6, 321)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attr": {
        "kernel": "(6, 321)", 
        "num_filter": "4"
      }, 
      "inputs": [[23, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose3", 
      "attr": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape4", 
      "attr": {"shape": "(0, 0, 0)"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad4", 
      "attr": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 6, 0, 0, 0)"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution4_weight", 
      "attr": {
        "kernel": "(7, 321)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution4_bias", 
      "attr": {
        "kernel": "(7, 321)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution4", 
      "attr": {
        "kernel": "(7, 321)", 
        "num_filter": "4"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose4", 
      "attr": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape5", 
      "attr": {"shape": "(0, 0, 0)"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad5", 
      "attr": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 7, 0, 0, 0)"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution5_weight", 
      "attr": {
        "kernel": "(8, 321)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution5_bias", 
      "attr": {
        "kernel": "(8, 321)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution5", 
      "attr": {
        "kernel": "(8, 321)", 
        "num_filter": "4"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose5", 
      "attr": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape6", 
      "attr": {"shape": "(0, 0, 0)"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attr": {
        "dim": "2", 
        "num_args": "6"
      }, 
      "inputs": [[8, 0, 0], [15, 0, 0], [22, 0, 0], [29, 0, 0], [36, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attr": {"p": "0.5"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attr": {
        "axis": "1", 
        "num_outputs": "100", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gru_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t99__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 99, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t99__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t98__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 98, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t98__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t97__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 97, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t97__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t96__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 96, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t96__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t95__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 95, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t95__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t94__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 94, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t94__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t93__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 93, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t93__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t92__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 92, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t92__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t91__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 91, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t91__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t90__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 90, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t90__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t89__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 89, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t89__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t88__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 88, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t88__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t87__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 87, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t87__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t86__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 86, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t86__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t85__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 85, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t85__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t84__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 84, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t84__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t83__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 83, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t83__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t82__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 82, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t82__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t81__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 81, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t81__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t80__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 80, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t80__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t79__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 79, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t79__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t78__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 78, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t78__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t77__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 77, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t77__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t76__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 76, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t76__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t75__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 75, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t75__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t74__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 74, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t74__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t73__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 73, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t73__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t72__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 72, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t72__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t71__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 71, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t71__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t70__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 70, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t70__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t69__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 69, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t69__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t68__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 68, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t68__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t67__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 67, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t67__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t66__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 66, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t66__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t65__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 65, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t65__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t64__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 64, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t64__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t63__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 63, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t63__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t62__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 62, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t62__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t61__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 61, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t61__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t60__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 60, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t60__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t59__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 59, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t59__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t58__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 58, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t58__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t57__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 57, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t57__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t56__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 56, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t56__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t55__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 55, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t55__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t54__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 54, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t54__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t53__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 53, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t53__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t52__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 52, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t52__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t51__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 51, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t51__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t50__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 50, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t50__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t49__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 49, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t49__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t48__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 48, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t48__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t47__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 47, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t47__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t46__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 46, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t46__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t45__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 45, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t45__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t44__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 44, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t44__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t43__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 43, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t43__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t42__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 42, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t42__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t41__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 41, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t41__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t40__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 40, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t40__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t39__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 39, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t39__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t38__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 38, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t38__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t37__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 37, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t37__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t36__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 36, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t36__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t35__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 35, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t35__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t34__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 34, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t34__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t33__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 33, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t33__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t32__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 32, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t32__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t31__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 31, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t31__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t30__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 30, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t30__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t29__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 29, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t29__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t28__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 28, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t28__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t27__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 27, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t27__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t26__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 26, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t26__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t25__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 25, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t25__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t24__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 24, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t24__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t23__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 23, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t23__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t22__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 22, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t22__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t21__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 21, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t21__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t20__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 20, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t20__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[207, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t19__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 19, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t19__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[209, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t18__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 18, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t18__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t17__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 17, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t17__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t16__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 16, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t16__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t15__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 15, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t15__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[217, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t14__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 14, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t14__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t13__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 13, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t13__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t12__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 12, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t12__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t11__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 11, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t11__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t10__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 10, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t10__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t9__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 9, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t9__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t8__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 8, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t8__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t7__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 7, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t7__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[233, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t6__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 6, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t6__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t5__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 5, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t5__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t4__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 4, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t4__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[239, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t3__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 3, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t3__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t2__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 2, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t2__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t1__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 1, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t1__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[245, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t0__i2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t0__i2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "_zeros", 
      "name": "gru_begin_state_0", 
      "attr": {
        "__layout__": "NC", 
        "dtype": "float32", 
        "shape": "(0, 5)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t0__h2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[249, 0, 0], [250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t0__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[248, 1, 0], [253, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t0__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[254, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar0", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[248, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t0__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[257, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul0", 
      "inputs": [[258, 0, 0], [253, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[248, 2, 0], [259, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t0__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul1", 
      "inputs": [[256, 0, 0], [261, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul2", 
      "inputs": [[255, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t0_out", 
      "inputs": [[262, 0, 0], [263, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t1__h2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[264, 0, 0], [250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t1__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[265, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[246, 1, 0], [266, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t1__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[267, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar1", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[268, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[246, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t1__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul3", 
      "inputs": [[271, 0, 0], [266, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[246, 2, 0], [272, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t1__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[273, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul4", 
      "inputs": [[269, 0, 0], [274, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5", 
      "inputs": [[268, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t1_out", 
      "inputs": [[275, 0, 0], [276, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t2__h2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[277, 0, 0], [250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t2__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[244, 1, 0], [279, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t2__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar2", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[281, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[244, 0, 0], [279, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t2__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[283, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul6", 
      "inputs": [[284, 0, 0], [279, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[244, 2, 0], [285, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t2__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul7", 
      "inputs": [[282, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul8", 
      "inputs": [[281, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t2_out", 
      "inputs": [[288, 0, 0], [289, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t3__h2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[290, 0, 0], [250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t3__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[242, 1, 0], [292, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t3__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[293, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar3", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[294, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[242, 0, 0], [292, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t3__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul9", 
      "inputs": [[297, 0, 0], [292, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[242, 2, 0], [298, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t3__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[299, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10", 
      "inputs": [[295, 0, 0], [300, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul11", 
      "inputs": [[294, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t3_out", 
      "inputs": [[301, 0, 0], [302, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t4__h2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[303, 0, 0], [250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t4__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[240, 1, 0], [305, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t4__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar4", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[240, 0, 0], [305, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t4__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[309, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul12", 
      "inputs": [[310, 0, 0], [305, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[240, 2, 0], [311, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t4__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[312, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul13", 
      "inputs": [[308, 0, 0], [313, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul14", 
      "inputs": [[307, 0, 0], [303, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t4_out", 
      "inputs": [[314, 0, 0], [315, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t5__h2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[316, 0, 0], [250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t5__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[317, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus16", 
      "inputs": [[238, 1, 0], [318, 1, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t5__z_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[319, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "_rminusscalar5", 
      "attr": {"scalar": "1.0"}, 
      "inputs": [[320, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[238, 0, 0], [318, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t5__r_act", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[322, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul15", 
      "inputs": [[323, 0, 0], [318, 2, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[238, 2, 0], [324, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "gru_t5__h_act", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[325, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul16", 
      "inputs": [[321, 0, 0], [326, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul17", 
      "inputs": [[320, 0, 0], [316, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "gru_t5_out", 
      "inputs": [[327, 0, 0], [328, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t6__h2h", 
      "attr": {"num_hidden": "15"}, 
      "inputs": [[329, 0, 0], [250, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t6__h2h_slice", 
      "attr": {"num_outputs": "3"}, 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus19", 
