{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(0, 1, 168, -1)"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad0", 
      "attrs": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 5, 0, 0, 0)"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution0_weight", 
      "attrs": {
        "kernel": "(6, 321)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution0_bias", 
      "attrs": {
        "kernel": "(6, 321)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution0", 
      "attrs": {
        "kernel": "(6, 321)", 
        "num_filter": "100"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose0", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(0, 0, 0)"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad1", 
      "attrs": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 11, 0, 0, 0)"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution1_weight", 
      "attrs": {
        "kernel": "(12, 321)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution1_bias", 
      "attrs": {
        "kernel": "(12, 321)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution1", 
      "attrs": {
        "kernel": "(12, 321)", 
        "num_filter": "100"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose1", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(0, 0, 0)"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad2", 
      "attrs": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 17, 0, 0, 0)"
      }, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "kernel": "(18, 321)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attrs": {
        "kernel": "(18, 321)", 
        "num_filter": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "kernel": "(18, 321)", 
        "num_filter": "100"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "transpose2", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape3", 
      "attrs": {"shape": "(0, 0, 0)"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "2", 
        "num_args": "3"
      }, 
      "inputs": [[8, 0, 0], [15, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attrs": {"p": "0.2"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "168", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gru_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "gru_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t167__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 167, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t167__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t166__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 166, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t166__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t165__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 165, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t165__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t164__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 164, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t164__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t163__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 163, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t163__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t162__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 162, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t162__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t161__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 161, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t161__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t160__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 160, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t160__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t159__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 159, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t159__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t158__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 158, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t158__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t157__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 157, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t157__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t156__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 156, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t156__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t155__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 155, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t155__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t154__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 154, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t154__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t153__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 153, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t153__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t152__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 152, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t152__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t151__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 151, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t151__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t150__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 150, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t150__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t149__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 149, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t149__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t148__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 148, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t148__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t147__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 147, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t147__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t146__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 146, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t146__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t145__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 145, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t145__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t144__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 144, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t144__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t143__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 143, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t143__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t142__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 142, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t142__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t141__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 141, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t141__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t140__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 140, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t140__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t139__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 139, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t139__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t138__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 138, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t138__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t137__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 137, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t137__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t136__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 136, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t136__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t135__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 135, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t135__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t134__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 134, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t134__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t133__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 133, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t133__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t132__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 132, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t132__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t131__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 131, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t131__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t130__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 130, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t130__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t129__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 129, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t129__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t128__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 128, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t128__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t127__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 127, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t127__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t126__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 126, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t126__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t125__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 125, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t125__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t124__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 124, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t124__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t123__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 123, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t123__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t122__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 122, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t122__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t121__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 121, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t121__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t120__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 120, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t120__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t119__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 119, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t119__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t118__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 118, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t118__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t117__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 117, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t117__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t116__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 116, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t116__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t115__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 115, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t115__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t114__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 114, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t114__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t113__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 113, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t113__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t112__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 112, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t112__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t111__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 111, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t111__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t110__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 110, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t110__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t109__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 109, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t109__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t108__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 108, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t108__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t107__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 107, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t107__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t106__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 106, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t106__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t105__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 105, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t105__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t104__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 104, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t104__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t103__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 103, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t103__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t102__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 102, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t102__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t101__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 101, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t101__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t100__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 100, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t100__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t99__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 99, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t99__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t98__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 98, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t98__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t97__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 97, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t97__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t96__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 96, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t96__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t95__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 95, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t95__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t94__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 94, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t94__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t93__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 93, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t93__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t92__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 92, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t92__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t91__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 91, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t91__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t90__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 90, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t90__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t89__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 89, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t89__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t88__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 88, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t88__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t87__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 87, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t87__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t86__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 86, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t86__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t85__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 85, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t85__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t84__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 84, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t84__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t83__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 83, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t83__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t82__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 82, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t82__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t81__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 81, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t81__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t80__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 80, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t80__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t79__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 79, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t79__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t78__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 78, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t78__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t77__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 77, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t77__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t76__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 76, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t76__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t75__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 75, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t75__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t74__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 74, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t74__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t73__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 73, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t73__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[216, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t72__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 72, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t72__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t71__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 71, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t71__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t70__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 70, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t70__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[222, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t69__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 69, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t69__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t68__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 68, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t68__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t67__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 67, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t67__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t66__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 66, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t66__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[230, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t65__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 65, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t65__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t64__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 64, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t64__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t63__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 63, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t63__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[236, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t62__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 62, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t62__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t61__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 61, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t61__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t60__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 60, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t60__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t59__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 59, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t59__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t58__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 58, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t58__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t57__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 57, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t57__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t56__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 56, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t56__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t55__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 55, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t55__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t54__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 54, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t54__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[254, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t53__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 53, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t53__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[256, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t52__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 52, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t52__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t51__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 51, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t51__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t50__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 50, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t50__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[262, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t49__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 49, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t49__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[264, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t48__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 48, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t48__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[266, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t47__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 47, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t47__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[268, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t46__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 46, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t46__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t45__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 45, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t45__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[272, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t44__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 44, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t44__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t43__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 43, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t43__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[276, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t42__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 42, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t42__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t41__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 41, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t41__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t40__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 40, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t40__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t39__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 39, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t39__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t38__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 38, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t38__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t37__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 37, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t37__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t36__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 36, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t36__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[290, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t35__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 35, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t35__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[292, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t34__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 34, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t34__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[294, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t33__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 33, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t33__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t32__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 32, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t32__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t31__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 31, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t31__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[300, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t30__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 30, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t30__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[302, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t29__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 29, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t29__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t28__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 28, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t28__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t27__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 27, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t27__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[308, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t26__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 26, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t26__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "gru_t25__i2h", 
      "attrs": {"num_hidden": "300"}, 
      "inputs": [[25, 25, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "gru_t25__i2h_slice", 
      "attrs": {"num_outputs": "3"}, 
